Qsd6917/NDT_Robot/塔克 l MC130编码器TT马达电机资料 V20240619/2 STM32电机PID教程/DB20 电机PID闭环控制程序源码/DB20_2编码器数据采集/DB20_2编码器数据采集/User/main.c
/**
	 __  _______  _    ____  _  __      __  __    ____   ___  _____ _____ 
	 \ \/ /_   _|/ \  |  _ \| |/ / 塔   \ \/ /   / ___| / _ \|  ___|_   _| 软
	  \  /  | | / _ \ | |_) | ' /  克    \  /____\___ \| | | | |_    | |   件
	  /  \  | |/ ___ \|  _ <| . \  创    /  \_____|__) | |_| |  _|   | |   生
	 /_/\_\ |_/_/   \_\_| \_\_|\_\ 新   /_/\_\   |____/ \___/|_|     |_|   态
                              
  ******************************************************************************
  * 
  * 版权所有： XTARK@塔克创新  版权所有，盗版必究
  * 官网网站： www.xtark.cn
  * 淘宝店铺： https://shop246676508.taobao.com  
  * 塔克媒体： www.cnblogs.com/xtark（博客）
	* 塔克微信： 微信公众号：塔克创新（获取最新资讯）
  *                              
  ******************************************************************************
  * @作  者  Musk Han@XTARK
  * @版  本  V1.0
  * @日  期  2019-7-26
  * @内  容  主程序
  *
  ******************************************************************************
  * @说  明
  *
  ******************************************************************************
  */

/* Includes ------------------------------------------------------------------*/
#include "stm32f10x.h"
#include <stdio.h>

#include "ax_sys.h"    //系统设置
#include "ax_delay.h"  //软件延时
#include "ax_led.h"  //LED灯控制
#include "ax_key.h"  //按键检测
#include "ax_vin.h"  //输入电压检测
#include "ax_uart_db.h"  //调试串口，USB串口	
#include "ax_motor.h"   //直流电机驱动
#include "ax_encoder.h"  //编码器驱动	
#include "ax_servo.h"   //舵机驱动

#include "ax_oled.h"  //OLED显示
#include "ax_oled_chinese.h" //汉字字模数据
#include "ax_oled_picture.h" //图片数据

/******************************************************************************
例程名称：正交AB编码器例程
例程说明：200ms电机编码器数值并串口输出显示
操作说明：电机连接后，即可手动转动电机观察串口输出值变化
*******************************************************************************/
int main(void)
{
	uint16_t temp;
	
	//设置中断优先级分组
	NVIC_PriorityGroupConfig(NVIC_PriorityGroup_2);  
	
	//调试串口初始化
	AX_UART_DB_Init(115200); //调试串口
	printf("  \r\n"); //输出空格，CPUBUG
	
	//JTAG口设置
	AX_JTAG_Set(JTAG_SWD_DISABLE);  //关闭JTAG接口 
	AX_JTAG_Set(SWD_ENABLE);  //打开SWD接口 可以利用主板的SWD接口调试 		
	
	//软件延时初始化
	AX_DELAY_Init(); 	
  AX_LED_Init();  
	
	//OLED初始化及配置
	AX_OLED_Init();
	AX_OLED_DisplayAsciiStr(0, 0, "ENCODER TEST", 0);
	AX_OLED_DisplayAsciiStr(0, 16, "NUM:", 0);	
	AX_OLED_RefreshScreen();

	//正交编码器初始化
  AX_ENCODER_Init(60000);  
	//设定中间值30000
	AX_ENCODER_SetCounter(30000); 
	
	//提示信息
	printf("正交编码器测试\r\n");
	
	while (1) 
	{		
		temp = AX_ENCODER_GetCounter();
		printf("*ENCODER:%5d \r\n",temp);  
		AX_OLED_DisplayValue(24, 16, temp, 5, 0, 0);  //显示数值
		AX_OLED_RefreshScreen();			
		AX_Delayms(200);
	}
}	

/******************* (C) 版权 2019 XTARK **************************************/
